{
  "work": [
    {
      "name": "Walgreens",
      "position": "Pharmacy Manager in Denver",
      "startDate": "2021-08-31",
      "endDate": "2025-01-01",
      "highlights": [
        "Ensured that each pharmacy was compliant with all appropriate federal standards and local regulations.",
        "Delivered excellent patient care in two different pharmacies, each averaging 450 prescriptions per day.",
        "Began the process of auditing long-neglected documentation and filing procedures to ensure legal compliance.",
        "Implemented changes in company policy from week to week as guidelines changed.",
        "Increased employee performance engagement by discussing goals and making a culture of inclusion.",
        "Discussed employee goals and improved communications to ensure that everyone was influencing our largest projects.",
        "Project management - including broad efforts to control inventory and to ensure long-term quality assurance."
      ],
      "summary": "Worked with neglected and understaffed pharmacies to improve team culture so they can perform at their best.",
      "url": "https://www.linkedin.com/company/walgreens/"
    },
    {
      "name": "Walgreens",
      "position": "Pharmacy Manager in Taos",
      "startDate": "2017-05-31",
      "endDate": "2021-08-31",
      "highlights": [
        "Managed pharmacist and technician budgets to ensure we were compliant legally and staffed to meet performance metrics.",
        "Responsible for discussing performance metrics and dispensing discipline where needed.",
        "Improved patient care through the use of MTM and by building a supportive network of provider relationships.",
        "Accountable for financial performance and customer service of the pharmacy in relation to chain expectations.",
        "Provided safe and excellent patient care and counseling in a pharmacy averaging 350 prescriptions per day.",
        "Developed the business for the company by improving adherence and increasing reimbursement.",
        "Worked with store and district leadership to ensure we met or exceeded all applicable standards.",
        "Increased patient satisfaction significantly through a process of change and development of staff and practices.",
        "Completely revamped the workflow and retrained every employee in multiple systems through formal instruction.",
        "Led team during many large changes, including software rollout and drastic changes in roles/expectations.",
        "Provided emotional and educational support & encouragement during the pandemic to help peers/patients.",
        "Developed constructive criticism skills further and gained experience with delivering timely feedback.",
        "Audited employee training compliance and created work plans that worked with our budget to remain efficient.",
        "Being a remote location, I was responsible for creative problem solving of many types, including technical expertise.",
        "This store was known to be a “problem” area, and we were able to build a reliable team to rectify that.",
        "Build relationships with team members throughout the store and from other cities to plan and to solve problems."
      ],
      "summary": "Trained, managed, and developed a large number of technicians and pharmacists in customer service and safety.",
      "url": "https://www.linkedin.com/company/walgreens/"
    }
  ]
}
